Repository: pingfangx/TranslatorX-other
Catalog: Gradle/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Initialization scripts make it extremely easy to apply build logic across all projects on a single machine.
zh_cn: Initialization scripts 使在一台机器上的所有项目中应用构建逻辑变得极其容易。

source: buildSrc project
zh_cn: buildSrc 项目

source: buildSrc uses the same source code conventions applicable to Java and Groovy projects.
zh_cn: buildSrc 使用了同样适用于 Java 和 Groovy 项目的 源代码约定。

source: myproject.java-conventions - configures conventions that are generic for any Java project in the organization.
zh_cn: myproject.java-conventions - 配置组织中任何 java 项目的通用约定。

source: myproject.library-conventions - adds publishing configuration to publish to the organization’s repository and checks for mandatory content in a README.
zh_cn: myproject.library-conventions - 添加发布配置以发布到组织的存储库，并检查自述文件中的强制内容。

source: org.gradle and com.gradleware namespaces may not be used.
zh_cn: 不能使用 org.gradle 和 com.gradleware 名称空间。

source: buildSrc should be preferred over script plugins as it is easier to maintain, refactor and test the code.
zh_cn: buildSrc 应优先于 script plugins，因为它更容易维护、重构和测试代码。

source: «plugin version» is also a string.
zh_cn: «plugin version» 也是一个字符串。

source: Applying a plugin means actually executing the plugin’s Plugin.apply(T) on the Project you want to enhance with the plugin.
zh_cn: 应用 插件意味着在你希望通过插件增强的项目上，实际执行插件的 Plugin.apply(T) 方法。

source: Resolving a plugin means finding the correct version of the jar which contains a given plugin and adding it to the script classpath.
zh_cn: 解析 插件，意味着找到包含给定插件的正确版本的 jar，并将其添加到脚本类路径中。

source: command line applications - applications with specific packaging requirements
zh_cn: command line applications - 具有特定打包要求的应用程序

source: internal libraries - libraries on which other subprojects depend on internally within the project
zh_cn: internal libraries - 项目内部其他子项目依赖的库

source: public libraries - libraries that are published to some repository
zh_cn: public libraries - 发布到某个仓库的库

source: web services - applications with specific packaging requirements that are different from above
zh_cn: web services - 具有与上述不同的特定打包要求的应用程序

source: A plugins {} block inside pluginManagement {} allows all plugin versions for the build to be defined in a single location.
zh_cn: pluginManagement {} 中的 plugins {} 块允许在单个位置定义构建的所有插件版本。

source: A Gradle plugin packages up reusable pieces of build logic, which can be used across many different projects and builds.
zh_cn: Gradle 插件打包了可重用的构建逻辑，可以在许多不同的项目和构建中使用。

source: A change in buildSrc causes the whole project to become out-of-date.
zh_cn: buildSrc 中的更改会导致整个项目过期。

source: A custom Gradle distribution is comprised of the standard Gradle distribution plus one or many custom initialization scripts.
zh_cn: 自定义 Gradle 分发由标准 Gradle 分发和一个或多个自定义初始化脚本组成。

source: A plugin can instead receive a parameter of type Settings, in which case the plugin can be applied in a settings script, or a parameter of type Gradle, in which case the plugin can be applied in an initialization script.
zh_cn: 插件可以接收类型为 Settings 的参数，在这种情况下，插件可以应用于 settings 脚本，或者类型为 Gradle 的参数，在这种情况下，插件可以应用于初始化脚本。

source: A plugin is simply any class that implements the Plugin interface.
zh_cn: 插件只是实现 Plugin 接口的任何类。

source: A plugin often starts out as a script plugin (because they are easy to write) and then, as the code becomes more valuable, it’s migrated to a binary plugin that can be easily tested and shared between multiple projects or organizations.
zh_cn: 一个插件通常从脚本插件开始(因为它们很容易编写)，然后，随着代码变得更有价值，它被迁移到一个二进制插件，可以在多个项目或组织之间轻松测试和共享。

source: A plugin should define the type of a subproject.
zh_cn: 插件应定义子项目的 类型。

source: A standalone project
zh_cn: 独立项目

source: A typical Gradle project with a settings file look as such:
zh_cn: 带有 settings 文件的典型 Gradle 项目如下所示：

source: A typical project including buildSrc has the following layout.
zh_cn: 一个典型的包含 buildSrc 的项目具有以下布局。

source: A typical project setup places the gradle.properties file in the root directory of the build.
zh_cn: 典型的项目设置会放置 gradle.properties 文件位于构建的根目录中。

source: Additional dependencies can be declared in a dedicated build.gradle under buildSrc.
zh_cn: 其他依赖项可以在专用的 buildSrc 目录下的 build.gradle 中声明。

source: Aligning Dependencies
zh_cn: 对齐依赖

source: All Gradle core plugins follow the software engineering paradigm convention over configuration.
zh_cn: 所有 Gradle 核心插件都遵循软件工程范式 convention over configuration。

source: All of the useful features, like the ability to compile Java code, are added by plugins.
zh_cn: 所有有用的功能，比如编译 Java 代码，都是由 插件 添加的

source: All other binary plugins must use the fully qualified form of the plugin id (e.g. com.github.foo.bar), although some legacy plugins may still utilize a short, unqualified form.
zh_cn: 所有其他二进制插件必须使用插件 id 的完全限定形式(例如 com.github.foo.bar)，尽管一些遗留插件可能仍然使用简短的、不限定的形式。

source: All plugins created in this sample contain functional tests that use TestKit to verify their behavior.
zh_cn: 本示例中创建的所有插件都包含使用 TestKit 检验其行为的功能测试。

source: Allow different plugins to use different versions of dependencies.
zh_cn: 允许不同的插件使用不同版本的依赖。

source: Allows a higher degree of modularization, enhancing comprehensibility and organization
zh_cn: 允许更高程度的模块化，增强可理解性和组织性

source: Also note that the Plugin class is a generic type.
zh_cn: 还要注意的是，Plugin 类是一种泛型类。

source: Alternatively, the file can also live in the GRADLE_USER_HOME directory if you want to it apply to all builds on your machine.
zh_cn: 或者，如果希望将该文件应用于计算机上的所有构建，则该文件也可以位于 GRADLE_USER_HOME 目录中。

source: Although there are conventional similarities between plugin ids and package names, package names are generally more detailed than is necessary for a plugin id.
zh_cn: 虽然插件 id 和包名之间有传统的相似之处，但包名通常比插件 id 所需的更详细。

source: Always add a settings.gradle to the root directory of your build to avoid the initial performance impact.
zh_cn: 因此始终将 settings.gradle 添加到构建的根目录中以避免初始性能影响。

source: Always define a settings file
zh_cn: 总是定义一个 settings 文件

source: An extension object is simply an object with Java Bean properties that represent the configuration.
zh_cn: 扩展对象只是一个具有代表配置的 JavaBean 属性的对象。

source: And because an extension object is simply a regular object, you can provide your own DSL nested inside the plugin block by adding properties and methods to the extension object.
zh_cn: 因为扩展对象只是一个普通对象，所以可以通过向扩展对象添加属性和方法来提供嵌套在插件块中的自己的 DSL。

source: Another, discouraged, way to share build logic between subproject is cross project configuration via the subprojects {} and allprojects {} DSL constructs.
zh_cn: 另一种不推荐的在子项目之间共享构建逻辑的方法是，通过 subprojects {} 和 allprojects {} DSL 结构来进行 跨项目配置。

source: Another, more complex and real-world example of a multi-project build that composes build logic using convention plugins is the build of the Gradle Build Tool itself.
zh_cn: 另一个更复杂、更真实的多项目使用约定插件来配置构建逻辑的示例，是 Gradle Build Tool 本身的构建。

source: Any code under buildSrc should use a package similar to application code.
zh_cn: buildSrc 下的任何代码都应该使用类似于应用程序代码的包。

source: Apply specific configuration (e.g. add organizational repositories or enforce standards)
zh_cn: 应用特定配置(例如，添加组织存库或 enforce 标准)

source: Applying a binary plugin
zh_cn: 应用二进制插件

source: Applying a plugin to a project allows the plugin to extend the project’s capabilities.
zh_cn: 将插件应用到项目中可以使插件扩展项目的功能。

source: Applying an external plugin in precompiled script plugin
zh_cn: 在预编译脚本插件中应用外部插件

source: Applying and testing changes in downstream dependencies without publishing.
zh_cn: 在不发布的情况下应用和测试下游依赖项中的更改。

source: Applying external plugins in precompiled script plugins
zh_cn: 在预编译脚本插件中应用外部插件

source: Applying external plugins with same version to subprojects
zh_cn: 将相同版本的外部插件应用于子项目

source: Applying other precompiled script plugins
zh_cn: 应用其他预编译脚本插件

source: Applying plugins from the buildSrc directory
zh_cn: 从 buildSrc 目录应用插件

source: Applying plugins is idempotent.
zh_cn: 应用插件是 idempotent (幂等的)。

source: Applying plugins or other configuration to subprojects of certain type.
zh_cn: 将插件或其他配置应用于特定类型的子项目。

source: Applying plugins with the buildscript block
zh_cn: 使用 buildscript 块应用插件

source: Applying plugins with the plugins DSL
zh_cn: 使用 plugins DSL 应用插件

source: Applying plugins:
zh_cn: 应用插件：

source: As an example, let’s say a project with three subprojects produces two public Java libraries that use the third subproject as an internal shared library.
zh_cn: 例如，假设一个包含三个子项目的项目生成两个公共 Java 库，它们使用第三个子项目作为内部共享库。

source: At the same time, the subprojects that share one common trait may serve different purposes - they may produce different artifact types that further differentiate them, for example:
zh_cn: 同时，共享一个共同特征的子项目可能有不同的用途——它们可能会产生不同 artifact types，会进一步区分它们，例如：

source: Authoring C++/Swift Builds
zh_cn: 编写 C++/Swift 构建

source: Authoring Gradle Builds
zh_cn: 编写 Gradle 构建

source: Authoring JVM Builds
zh_cn: 编写 JVM 构建

source: Authoring Sustainable Builds
zh_cn: 编写可持续的构建

source: Authoring Tasks
zh_cn: 编写任务

source: Avoid overlapping task outputs
zh_cn: 避免任务输出重叠

source: Avoiding Traps
zh_cn: 避免陷阱

source: Avoiding Unnecessary Task Configuration
zh_cn: 避免不必要的任务配置

source: Behind the scenes
zh_cn: 幕后细节

source: Binary plugins
zh_cn: 二进制插件

source: Binary plugins are written either programmatically by implementing Plugin interface or declaratively using one of Gradle’s DSL languages.
zh_cn: 二进制插件可以通过实现 Plugin 接口以编程方式编写，也可以使用 Gradle 的一种 DSL 语言以声明方式编写。

source: Binary plugins can reside within a build script, within the project hierarchy or externally in a plugin jar.
zh_cn: 二进制插件可以驻留在项目层次结构的构建脚本，或外部插件 jar 中。

source: Binary plugins that have been published as external jar files can be added to a project by adding the plugin to the build script classpath and then applying the plugin.
zh_cn: 已发布为外部 jar 文件的二进制插件，可以通过将插件添加到构建脚本类路径中，然后再应用插件来添加到项目中。

source: Build a simple Android app.
zh_cn: 构建一个简单的 Android 应用程序。

source: Build logs for public Continuous Integration services are world-viewable and can expose this sensitive information.
zh_cn: 公共持续集成的服务构建日志是全局可视的，会公开这些敏感信息。

source: Build organization
zh_cn: 构建组织

source: Building C++ projects
zh_cn: 构建 C++ 项目

source: Building Java & JVM projects
zh_cn: 构建 Java & JVM 项目

source: Building Swift projects
zh_cn: 构建 Swift 项目

source: Bundle the initialization scripts with the Gradle distribution.
zh_cn: 将初始化脚本与 Gradle 分发捆绑在一起。

source: But, you can use the apply false syntax to tell Gradle not to apply the plugin to the current project and then use the plugins {} block without the version in subprojects' build scripts:
zh_cn: 但是，你可以使用 apply false 语法来告诉 Gradle 不要将插件应用于当前项目，然后在子项目构建脚本中使用不带版本的 plugins {} 块：

source: By applying myproject.java-conventions plugin we state: this is a "Java" project.
zh_cn: 通过应用 myproject.java-conventions 插件我们声明：这是一个“Java”项目。

source: By applying myproject.library-conventions plugin we state: this is a "Library" project.
zh_cn: 通过应用 myproject.library-conventions 插件我们声明：这是一个“Library”项目。

source: By applying plugins, rather than adding logic to the project build script, we can reap a number of benefits.
zh_cn: 比起向项目构建脚本中添加逻辑，通过应用插件我们可以获得许多好处。

source: By default, the plugins {} DSL resolves plugins from the public Gradle Plugin Portal. Many build authors would also like to resolve plugins from private Maven or Ivy repositories because the plugins contain proprietary implementation details, or just to have more control over what plugins are available to their builds.
zh_cn: 默认情况下，plugins {}DSL 从公共的 Gradle Plugin Portal 解析插件。但许多构建作者还希望从私有 Maven 或 Ivy 仓库解析插件，因为这些插件包含专有的实现细节，或者只是为了更好地控制哪些插件可用于他们的构建。

source: By sticking to the default conventions, new developers to the project immediately know how to find their way around.
zh_cn: 通过坚持默认约定，项目的新开发人员立即知道如何找到解决方法

source: By this, the actual location will only be resolved when the file is needed and can be reconfigured at any time during build configuration.
zh_cn: 这样，只有在需要文件时才会解析实际位置，并且可以在构建配置期间随时重新配置文件。

source: Caching Android Project
zh_cn: 缓存 Android 项目

source: Caching Java Project
zh_cn: 缓存 Java 项目

source: Can only be used in build scripts and settings file
zh_cn: 只能在构建脚本和 settings 文件中使用

source: Cannot contain consecutive '.' characters (i.e. '..').
zh_cn: 不能包含连续的“.”字符(即“..”)。

source: Cannot start or end with a '.' character.
zh_cn: 不能以“.”字符开头或结尾。

source: Capturing user input from the build script through an extension and mapping it to input/output properties of a custom task is a useful pattern.
zh_cn: 通过扩展从构建脚本捕获用户输入，并将其映射到自定义任务的输入/输出属性是一种有用的模式。

source: Change the Wrapper files of all projects to point to the URL of the custom Gradle distribution.
zh_cn: 将所有项目的包装文件更改为指向自定义 Gradle 分发的 URL。

source: Code quality rules apply to all of the code subprojects but not the documentation subproject.
zh_cn: 代码质量规则适用于所有 代码 子项目，但不适用于 文档 子项目。

source: Command-Line Interface
zh_cn: 命令行界面

source: Compatibility Notes
zh_cn: 兼容性说明

source: Compiling convention plugins
zh_cn: 编译约定插件

source: Complex build logic is usually a good candidate for being encapsulated either as custom task or binary plugin.
zh_cn: 复杂的构建逻辑通常适合封装为自定义任务或二进制插件。

source: Composing Builds
zh_cn: 复合构建

source: Configure the project according to conventions (e.g. add new tasks or configure sensible defaults)
zh_cn: 根据约定配置项目(例如，添加新任务或配置合理的默认值)

source: Configuring Tasks Lazily
zh_cn: 延时配置任务

source: Configuring the Build Environment
zh_cn: 配置构建环境

source: Configuring the Gradle Daemon
zh_cn: 配置 Gradle 守护程序

source: Constrained Syntax
zh_cn: 受限语法

source: Controlling Transitives
zh_cn: 控制传递性

source: Convention Plugins
zh_cn: 约定插件

source: Conventionally use a lowercase reverse domain name convention for the namespace.
zh_cn: 按照惯例，名称空间使用小写的反向域名约定。

source: Conventionally use only lowercase characters in the name.
zh_cn: 按照惯例，名称中只使用小写字符。

source: Core Gradle plugins are special in that they provide short names, such as 'java' for the core JavaPlugin.
zh_cn: 核心 Gradle 插件的特殊之处在于，它们提供了简短的名称，例如核心 JavaPlugin 的名称为 'java'。

source: Core Plugins
zh_cn: 核心插件

source: Core binary plugins provided as part of the Gradle distribution are automatically resolved.
zh_cn: 作为 Gradle 分发的一部分提供的核心二进制插件也会自动解析。

source: Creating a Basic Multi-Project Build
zh_cn: 创建基本的多项目构建

source: Creating a plugin id
zh_cn: 创建插件 id

source: Cross configuration can also introduce configuration-time coupling between projects, which can prevent optimizations like configuration-on-demand from working properly.
zh_cn: 跨项目配置还会在项目之间引入 项目间配置时耦合，这会阻止类似 configuration-on-demand 这样的优化正常工作。

source: Cross project configuration
zh_cn: 跨项目配置

source: Custom Gradle distributions are a practical solution to this very problem.
zh_cn: 自定义 Gradle 分发是对此问题的实用解决方案。

source: Custom Gradle distributions may also contain a gradle.properties file in the root of the distribution, which provide an organization-wide set of properties that control the build environment.
zh_cn: 自定义 Gradle 分发也可能包含分发根目录中的 gradle.properties 文件，该文件提供了一组组织范围内的 控制构建环境的属性。

source: Custom Maven and Ivy plugin repositories must contain plugin marker artifacts in addition to the artifacts which actually implement the plugin.
zh_cn: 自定义 Maven 和 Ivy 插件库，除了实际实现插件的库以外，还必须包含 plugin marker artifacts。

source: Custom Plugin Repositories
zh_cn: 自定义插件仓库

source: Custom task and plugin implementations should not live in the build script.
zh_cn: 自定义任务和插件实现不应该保存到构建脚本中。

source: Customizing Execution
zh_cn: 自定义执行

source: Customizing Publishing
zh_cn: 自定义发布

source: Customizing Resolution
zh_cn: 定制解析

source: Debugging Caching Issues
zh_cn: 调试缓存问题

source: Declare properties in gradle.properties file
zh_cn: 在 gradle.properties 文件中声明属性

source: Declaring Capabilities of a Library
zh_cn: 声明库的功能

source: Declaring Dependencies
zh_cn: 声明依赖

source: Declaring Dependencies between Subprojects
zh_cn: 声明子项目之间的依赖关系

source: Declaring Repositories
zh_cn: 宣布仓库

source: Declaring Rich Versions
zh_cn: 声明富版本

source: Declaring Variant Attributes
zh_cn: 声明变体属性

source: Declaring Versions
zh_cn: 声明版本

source: Declaring Versions and Ranges
zh_cn: 声明版本和范围

source: Define one or many initialization scripts with the desired logic.
zh_cn: 用所需的逻辑定义一个或多个初始化脚本。

source: Defining and using a composite build
zh_cn: 定义和使用复合构建

source: Defining and using a composite build to combine multiple independent builds.
zh_cn: 定义并使用复合构建来组合多个独立构建。

source: Defining the plugin as a source file under the buildSrc directory in the project (see Using buildSrc to extract functional logic).
zh_cn: 将插件定义为项目中 buildSrc 目录下的源文件(请参见 Using buildSrc to extract functional logic)。

source: Defining the plugin as an inline class declaration inside a build script.
zh_cn: 将插件定义为构建脚本中的内联类声明。

source: Designing Plugins
zh_cn: 设计插件

source: Developers only need to point their checked-in Wrapper files to the URL of the custom Gradle distribution.
zh_cn: 开发人员只需将其签入的 Wrapper 指向自定义 Gradle 分发的 URL 即可。

source: Developing Custom Gradle Plugins
zh_cn: 开发自定义 Gradle 插件

source: Developing Gradle Plugins
zh_cn: 开发 Gradle 插件

source: Developing Gradle Tasks
zh_cn: 开发 Gradle 任务

source: Developing Parallel Tasks
zh_cn: 开发并行任务

source: Developing a Gradle plugin in a build without publishing.
zh_cn: 在不发布的情况下在构建中开发 Gradle 插件。

source: Developing project extensions
zh_cn: 开发项目扩展

source: Downgrading and Excluding
zh_cn: 降级和排除

source: Enabling and Configuring
zh_cn: 启用和配置

source: Encapsulates imperative logic and allows build scripts to be as declarative as possible
zh_cn: 封装命令式逻辑，并允许构建脚本尽可能具有声明性

source: Even better - you can encapsulate the versions of external plugins by composing the build logic using your own convention plugins.
zh_cn: 更好的方案是，你可以通过使用自己的 约定插件组合构建逻辑来封装外部插件的版本。

source: Executing Multi-Project Builds
zh_cn: 执行多项目构建

source: Extend the Gradle model (e.g. add new DSL elements that can be configured)
zh_cn: 扩展 Gradle 模型(例如，添加可配置的新 DSL 元素)

source: External jars can be added to the build script classpath using the buildscript {} block as described in External dependencies for the build script.
zh_cn: 外部 jar 可以使用 buildscript {} 块添加到构建脚本 classpath 中，如 External dependencies for the build script 中所述。

source: Extracting information from subprojects of a certain type.
zh_cn: 从特定类型的子项目中提取信息。

source: Filesystem locations are relative to the project directory, while remote script locations are specified with an HTTP URL.
zh_cn: 文件系统位置相对于项目目录，而远程脚本位置是用 HTTP URL 指定的。

source: Finally, apply the script plugin to the root project as follows:
zh_cn: 最后，将脚本插件应用于根项目，如下所示：

source: Finally, the Ivy repository at ../ivy-repo will be checked.
zh_cn: 最后，将在 ../ivy-repo 的 Ivy 仓库中查找。

source: Finding community plugins
zh_cn: 查找社区插件

source: Fine Tuning the Project Layout
zh_cn: 精细调整项目布局

source: First of all, you will have to communicate the setup process across all developers in the company.
zh_cn: 首先，你必须在公司的所有开发人员之间沟通安装过程。

source: First, it needs to resolve the plugin, and then it needs to apply the plugin to the target, usually a Project.
zh_cn: 首先，它需要 resolve (解析) 插件，然后它需要 apply (应用) 插件到目标上，目标通常是一个 Project。

source: First, you need a buildSrc/build.gradle.kts file that applies the kotlin-dsl plugin:
zh_cn: 首先，你需要一个 buildSrc/build.gradle.kts 文件，应用 kotlin-dsl 插件：

source: First, you need a buildSrc/build.gradle file that applies the groovy-gradle-plugin plugin:
zh_cn: 首先，你需要一个 buildSrc/build.gradle 文件，应用 groovy-gradle-plugin 插件：

source: Fixing Metadata
zh_cn: 修复元数据

source: Following Best Practices
zh_cn: 遵循最佳实践

source: For all intents and purposes, they are binary plugins and can be applied by plugin ID, tested and published as binary plugins.
zh_cn: 对于所有意图和目的，它们是二进制插件，可以通过插件 id 应用、测试和发布为二进制插件。

source: For each of the example traits from the beginning of this section, we can write a plugin that encapsulates the logic common to the subproject of a given type.
zh_cn: 对于本节开头的每个示例特征，我们可以编写一个插件，封装给定 类型 的子项目通用的逻辑。

source: For example if you had a Github account named "foo" and your plugin was named "bar", a suitable plugin id might be com.github.foo.bar.
zh_cn: 例如，如果你有一个名为“foo”的 Github 帐户，并且你的插件名为“bar”，那么合适的插件 id 可能是 com.github.foo.bar。

source: For example you may want to pass in a specific property value to control runtime behavior just for this one invocation of the build.
zh_cn: 例如，你可能希望传入一个特定的属性值，以便仅为单次构建控制运行时行为。

source: For example, a project applying the Java plugin will automatically compile the code in the directory src/main/java.
zh_cn: 例如，应用 Java plugin 的项目将自动编译在目录 src/main/java 中的源代码。

source: For example, several subprojects may contain code in a particular programming language while another subproject may be dedicated for documentation.
zh_cn: 例如，几个子项目可能包含特定编程语言中的 代码，而另一个子项目可能专用于 文档。

source: For example, the following complete sample from the sample-plugins project shows how to publish a com.example.hello plugin and a com.example.goodbye plugin to both an Ivy and Maven repository using the combination of the java-gradle-plugin, the maven-publish plugin, and the ivy-publish plugin.
zh_cn: 例如，来自 sample-plugins 项目的以下完整示例，显示了如何发布 com.example.hello 插件和 com.example.goodbye 插件到 Ivy 和 Maven 仓库，通过一起使用 java-gradle-plugin，maven-publish 插件，以及 ivy-publish 插件。

source: For example, the script src/main/groovy/java-library-convention.gradle would have a plugin ID of java-library-convention.
zh_cn: 例如，脚本 src/main/groovy/java-library-convention.gradle 的插件 ID 为 java-library-convention。

source: For example, the script src/main/kotlin/java-library-convention.gradle.kts would have a plugin ID of java-library-convention (assuming it has no package declaration).
zh_cn: 例如，脚本 src/main/kotlin/java-library-convention.gradle.kts 将具有 java-library-convention 的插件 ID(假设它没有包声明)。

source: For example, to declare a in-house repository and its credentials.
zh_cn: 例如，声明内部存储库及其凭据。

source: For instance, it might seem reasonable to add "gradle" as a component of your plugin id, but since plugin ids are only used for Gradle plugins, this would be superfluous.
zh_cn: 例如，添加“gradle”作为插件 id 的一个组件似乎是合理的，但由于插件 id 仅用于 gradle 插件，这将会很多余。

source: For more details about included builds, see Composing Builds chapter.
zh_cn: 有关 included build 的更多详细信息，请参阅 Composing Builds 章节。

source: For more details on authoring custom Gradle plugins, consult the user manual.
zh_cn: 有关编写自定义 Gradle 插件的更多详细信息，请参阅 user manual。

source: For more information about buildSrc, consult Using buildSrc to organize build logic.
zh_cn: 有关 buildSrc 的更多信息，请参阅 Using buildSrc to organize build logic。

source: For more information on publishing plugins to custom repositories read Gradle Plugin Development Plugin.
zh_cn: 有关将插件发布到自定义仓库的更多信息，请阅读 Gradle Plugin Development Plugin。

source: For more information on the inner workings of plugins, see Custom Plugins.
zh_cn: 有关插件内部工作原理的更多信息，请参阅 Custom Plugins。

source: For more on defining your own plugins, see Custom Plugins.
zh_cn: 有关定义自己的插件的更多信息，请参阅 Custom Plugins。

source: For multi-project builds there can be only one buildSrc directory, which has to sit in the root project directory.
zh_cn: 对于多项目构建，只能有一个 buildSrc 目录，它必须位于根项目目录中。

source: For that purpose, the runtime walks the hierarchy of the directory tree up to the root directory.
zh_cn: 为此，运行时将遍历目录树的层次结构，直至根目录。

source: For this example let’s also say that we want to enforce that our libraries expose some documentation with a common structure.
zh_cn: 在这个例子中，我们还想强制要求我们的库公开一些具有公共结构的文档。

source: From the use case above, we have identified that we have two types of projects - generic Java projects and public libraries.
zh_cn: 从上面的用例中，我们发现我们有两种类型的项目 - 通用 Java 项目和公共库。

source: Furthermore, it is not necessary to append .class to identify a class literal in Groovy as it is in Java.
zh_cn: 另外在 Groovy 中，不需要像在 Java 中一样添加 .class 来标识的类字面量。

source: Furthermore, one need to append the ::class suffix to identify a class literal in Kotlin instead of .class in Java.
zh_cn: 另外在 Kotlin 中需要追加 ::class 后缀以识别类字面量，而不像在 java 中使用 .class。

source: Furthermore, updating the initialization script logic uniformly can prove challenging.
zh_cn: 此外，统一更新初始化脚本逻辑可能具有挑战性。

source: Future versions of Gradle will remove this restriction.
zh_cn: Gradle 的未来版本将取消此限制。
